{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["Input_2", 0, 0]], "output_layers": [["Convolution2D_28", 0, 0]], "layers": [{"name": "Input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 256, 2], "dtype": "float32", "sparse": false, "name": "Input_2"}}, {"name": "Convolution2D_1", "inbound_nodes": [[["Input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_1", "kernel_size": [7, 7], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_1", "inbound_nodes": [[["Convolution2D_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_1", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_3", "inbound_nodes": [[["MaxPooling2D_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_3", "kernel_size": [5, 5], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_3", "inbound_nodes": [[["Convolution2D_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_3", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_17", "inbound_nodes": [[["MaxPooling2D_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_17", "kernel_size": [5, 5], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_8", "inbound_nodes": [[["Convolution2D_17", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_8", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_4", "inbound_nodes": [[["MaxPooling2D_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_4", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_9", "inbound_nodes": [[["Convolution2D_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_9", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_5", "inbound_nodes": [[["Convolution2D_9", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_5", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_10", "inbound_nodes": [[["MaxPooling2D_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_10", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_11", "inbound_nodes": [[["Convolution2D_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_11", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_6", "inbound_nodes": [[["Convolution2D_11", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_6", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_12", "inbound_nodes": [[["MaxPooling2D_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_12", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_13", "inbound_nodes": [[["Convolution2D_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_13", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1024, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "MaxPooling2D_7", "inbound_nodes": [[["Convolution2D_13", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_7", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"name": "Convolution2D_14", "inbound_nodes": [[["MaxPooling2D_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_14", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1024, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Deconvolution2D_4", "inbound_nodes": [[["Convolution2D_14", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "Deconvolution2D_4", "kernel_size": [4, 4], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_18", "inbound_nodes": [[["Convolution2D_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_18", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "BatchNormalization_1", "inbound_nodes": [[["Deconvolution2D_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_1", "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "UpSampling2D_1", "inbound_nodes": [[["Convolution2D_18", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_1", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"name": "concatenate_1", "inbound_nodes": [[["Convolution2D_12", 0, 0, {}], ["BatchNormalization_1", 0, 0, {}], ["UpSampling2D_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 3, "trainable": true}}, {"name": "Convolution2D_19", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_19", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Deconvolution2D_5", "inbound_nodes": [[["Convolution2D_19", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "Deconvolution2D_5", "kernel_size": [4, 4], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "filters": 256, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_20", "inbound_nodes": [[["Convolution2D_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_20", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "BatchNormalization_2", "inbound_nodes": [[["Deconvolution2D_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_2", "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "UpSampling2D_2", "inbound_nodes": [[["Convolution2D_20", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_2", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"name": "concatenate_2", "inbound_nodes": [[["Convolution2D_10", 0, 0, {}], ["BatchNormalization_2", 0, 0, {}], ["UpSampling2D_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": 3, "trainable": true}}, {"name": "Convolution2D_21", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_21", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Deconvolution2D_24", "inbound_nodes": [[["Convolution2D_21", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "Deconvolution2D_24", "kernel_size": [4, 4], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "filters": 128, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_22", "inbound_nodes": [[["Convolution2D_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_22", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "BatchNormalization_3", "inbound_nodes": [[["Deconvolution2D_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_3", "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "UpSampling2D_3", "inbound_nodes": [[["Convolution2D_22", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_3", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"name": "concatenate_3", "inbound_nodes": [[["Convolution2D_4", 0, 0, {}], ["BatchNormalization_3", 0, 0, {}], ["UpSampling2D_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_3", "axis": 3, "trainable": true}}, {"name": "Convolution2D_23", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_23", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Deconvolution2D_7", "inbound_nodes": [[["Convolution2D_23", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "Deconvolution2D_7", "kernel_size": [4, 4], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_24", "inbound_nodes": [[["Convolution2D_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_24", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "BatchNormalization_4", "inbound_nodes": [[["Deconvolution2D_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_4", "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "UpSampling2D_4", "inbound_nodes": [[["Convolution2D_24", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_4", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"name": "concatenate_4", "inbound_nodes": [[["MaxPooling2D_3", 0, 0, {}], ["BatchNormalization_4", 0, 0, {}], ["UpSampling2D_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_4", "axis": 3, "trainable": true}}, {"name": "Convolution2D_25", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_25", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Deconvolution2D_8", "inbound_nodes": [[["Convolution2D_25", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "Deconvolution2D_8", "kernel_size": [4, 4], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "filters": 32, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_26", "inbound_nodes": [[["Convolution2D_25", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_26", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "BatchNormalization_5", "inbound_nodes": [[["Deconvolution2D_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_5", "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "UpSampling2D_5", "inbound_nodes": [[["Convolution2D_26", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_5", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"name": "concatenate_5", "inbound_nodes": [[["MaxPooling2D_1", 0, 0, {}], ["BatchNormalization_5", 0, 0, {}], ["UpSampling2D_5", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_5", "axis": 3, "trainable": true}}, {"name": "Convolution2D_27", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_27", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}, {"name": "Convolution2D_28", "inbound_nodes": [[["Convolution2D_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "Convolution2D_28", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "filters": 1, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true}}]}}